# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 's3cmd'
brew 'git'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'wget'

# Development
brew 'bower'
brew 'composer'
brew 'dnsmasq'
brew 'fabric'
brew 'ffmpeg'
brew 'httpd'
brew 'imagemagick'
brew 'mariadb'
brew 'memcached'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'redis'
brew 'sphinx --with-mysql'
brew 'wp-cli'

# Apps
cask '1password'
cask 'acorn'
cask 'alfred'
cask 'arq'
cask 'brave-browser'
cask 'caffeine'
cask 'cardhop'
cask 'codekit'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'fork'
cask 'forklift'
cask 'imageoptim'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner'
cask 'licecap'
cask 'macdown'
cask 'nvalt'
cask 'on-the-job'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'superduper'
cask 'the-hit-list'
cask 'the-unarchiver'
cask 'transmit'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'xact'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Copied', id: 1026349850
mas 'DaisyDisk', id: 411643860
mas 'Giphy Capture', id: 668208984
mas 'Moom', id: 402476602
mas 'Sketch', id: 852320343
mas 'Skitch', id: 402476602
mas 'Tweetbot', id: 557168941
mas 'unDock', id: 402359583
